In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('/home/dipendra/django/Pandas Practical/Fortune_5.csv')
df

   ID             Name            Industry      Profit Growth
0   1          Lamtone         IT Services   5274553.0    30%
1   2        Stripfind  Financial Services  11412916.0    20%
2   3  Canecorporation              Health   3005820.0    21%
3   4              NaN         IT Services   6597557.0    NaN
4   5              NaN                 NaN         NaN    NaN

***dropna() --> drops all the NaN Values from dataset***

In [3]:
df.dropna()

   ID             Name            Industry      Profit Growth
0   1          Lamtone         IT Services   5274553.0    30%
1   2        Stripfind  Financial Services  11412916.0    20%
2   3  Canecorporation              Health   3005820.0    21%

## dropna() Parameters

***dropna(axis = 1) ---> drops entire column that has NaN***

In [4]:
df.dropna(axis = 1)

   ID
0   1
1   2
2   3
3   4
4   5

 ***dropna(how = 'any') --> drops rows that has NaN value***

In [5]:
df.dropna(how = 'any')

   ID             Name            Industry      Profit Growth
0   1          Lamtone         IT Services   5274553.0    30%
1   2        Stripfind  Financial Services  11412916.0    20%
2   3  Canecorporation              Health   3005820.0    21%

***df.dropna(axis = 1, how = 'any') --> Drops entire column that has NaN value***

In [6]:
df.dropna(axis = 1, how = 'any')

   ID
0   1
1   2
2   3
3   4
4   5

***dropna( how = 'all') --> drops entire rows/columns if all the value is NaN***

In [10]:
df = pd.read_csv('/home/dipendra/django/Pandas Practical/Fortune_5.csv')
df

    ID             Name            Industry      Profit Growth
0  1.0          Lamtone         IT Services   5274553.0    30%
1  2.0        Stripfind  Financial Services  11412916.0    20%
2  3.0  Canecorporation              Health   3005820.0    21%
3  4.0              NaN         IT Services   6597557.0    NaN
4  NaN              NaN                 NaN         NaN    NaN

In [11]:
df.dropna(how = 'all')

    ID             Name            Industry      Profit Growth
0  1.0          Lamtone         IT Services   5274553.0    30%
1  2.0        Stripfind  Financial Services  11412916.0    20%
2  3.0  Canecorporation              Health   3005820.0    21%
3  4.0              NaN         IT Services   6597557.0    NaN

***dropna(thresh = 1)---> prints those row that has atleat one notnull() value***

In [12]:
df.dropna(thresh=1)

    ID             Name            Industry      Profit Growth
0  1.0          Lamtone         IT Services   5274553.0    30%
1  2.0        Stripfind  Financial Services  11412916.0    20%
2  3.0  Canecorporation              Health   3005820.0    21%
3  4.0              NaN         IT Services   6597557.0    NaN

In [13]:
df.dropna(thresh=4)

    ID             Name            Industry      Profit Growth
0  1.0          Lamtone         IT Services   5274553.0    30%
1  2.0        Stripfind  Financial Services  11412916.0    20%
2  3.0  Canecorporation              Health   3005820.0    21%

***dropna(subset = ['Col_name']) ---> Drops entire row if assignmed column has atleast on NaN value***

In [14]:
df = pd.read_csv('/home/dipendra/django/Pandas Practical/Fortune_5.csv')
df

    ID             Name            Industry      Profit Growth
0  1.0          Lamtone         IT Services   5274553.0    30%
1  2.0        Stripfind  Financial Services  11412916.0    20%
2  3.0  Canecorporation              Health   3005820.0    21%
3  4.0              NaN         IT Services   6597557.0    NaN
4  NaN              NaN                 NaN         NaN    NaN

In [15]:
df.dropna(subset = ['ID'])

    ID             Name            Industry      Profit Growth
0  1.0          Lamtone         IT Services   5274553.0    30%
1  2.0        Stripfind  Financial Services  11412916.0    20%
2  3.0  Canecorporation              Health   3005820.0    21%
3  4.0              NaN         IT Services   6597557.0    NaN

In [16]:
df.dropna(subset = ['Name'])

    ID             Name            Industry      Profit Growth
0  1.0          Lamtone         IT Services   5274553.0    30%
1  2.0        Stripfind  Financial Services  11412916.0    20%
2  3.0  Canecorporation              Health   3005820.0    21%

***dropna(inplace = True) --> drops the entire row where there is NaN value.***

In [18]:
df.dropna(inplace = True)
df

    ID             Name            Industry      Profit Growth
0  1.0          Lamtone         IT Services   5274553.0    30%
1  2.0        Stripfind  Financial Services  11412916.0    20%
2  3.0  Canecorporation              Health   3005820.0    21%